Autodesk.Revit.DB.Structure.FabricArea.GetReinforcementRoundingManager
Returns an object for managing reinforcement rounding override settings.
Returns:
The rounding manager.
Since:
2014

Autodesk.Revit.DB.Structure.FabricArea.RemoveFabricReinforcementSystem(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.Structure.FabricArea)
Deletes the specified FabricArea, and converts its FabricSheet elements
to equivalent Single Fabric Sheet elements.
doc:
The document.
system:
An FabricArea Reinforcement element in the document.
Returns:
The ids of the newly created Single Fabric Sheet elements.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The element system was not found in the given document.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2015

Autodesk.Revit.DB.Structure.FabricArea.Create(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.Element,Autodesk.Revit.DB.XYZ,Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.ElementId)
Creates a FabricArea based on a host boundary.
aDoc:
The document.
hostElement:
The element that will host the FabricArea. The host can be a Structural Floor, Structural Wall, Structural Slab, or a Part created from a structural layer belonging to one of those element types.
majorDirection:
A vector to define the major direction of the FabricArea.
fabricAreaTypeId:
The id of the FabricAreaType.
fabricSheetTypeId:
The id of the FabricSheetType.
Returns:
The newly created FabricArea.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The element hostElement was not found in the given document.
-or-
the host Element is not a valid host for Area Reinforcement, Path Reinforcement, Fabric Area or Fabric Sheet.
-or-
fabricAreaTypeId should refer to an FabricAreaType element.
-or-
fabricSheetTypeId should refer to an FabricSheetType element.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
majorDirection has zero length.
Since:
2015

Autodesk.Revit.DB.Structure.FabricArea.Create(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.Element,System.Collections.Generic.IList{Autodesk.Revit.DB.CurveLoop},Autodesk.Revit.DB.XYZ,Autodesk.Revit.DB.XYZ,Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.ElementId)
Creates a FabricArea from an array of curves.
aDoc:
The document.
hostElement:
The element that will host the FabricArea. The host can be a Structural Floor, Structural Wall, Structural Slab, or a Part created from a structural layer belonging to one of those element types.
curveLoops:
An array of curves that will define the outline of the FabricArea.
This includes curves defining openings in the interior of the area.
majorDirection:
A vector to define the major direction of the FabricArea.
majorDirectionOrigin:
An origin point of the major direction line
fabricAreaTypeId:
The id of the FabricAreaType.
fabricSheetTypeId:
The id of the FabricSheetType.
Returns:
The newly created FabricArea.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Not all curveLoops in curveLoops are closed and continuous.
-or-
Not all curveLoops in curveLoops are in the same plane.
-or-
curveLoops should only contain lines or arcs.
-or-
The element hostElement was not found in the given document.
-or-
the host Element is not a valid host for Area Reinforcement, Path Reinforcement, Fabric Area or Fabric Sheet.
-or-
fabricAreaTypeId should refer to an FabricAreaType element.
-or-
fabricSheetTypeId should refer to an FabricSheetType element.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
majorDirection has zero length.
Since:
2015

Autodesk.Revit.DB.Structure.FabricArea.FabricLocation
The Fabric location in the host.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Since:
2013

Autodesk.Revit.DB.Structure.FabricArea.FabricSheetTypeId
The id of the Fabric Sheet Type for this element.
Remarks:
Changing the value of this property causes change of MinorLapSplice and MajorLapSplice properties if needed
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: fabricSheetTypeId is not a Fabric Sheet Type.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Since:
2013

Autodesk.Revit.DB.Structure.FabricArea.MinorSheetAlignment
The fabric sheet alignment in the fabric distribution in the minor direction.
Remarks:
Changing the value of this property causes change of MinorLapSplice and LapSplicePosition properties if needed
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Since:
2013

Autodesk.Revit.DB.Structure.FabricArea.MajorSheetAlignment
The fabric sheet alignment in the fabric distribution in the major direction.
Remarks:
Changing the value of this property causes change of MajorLapSplice and LapSplicePosition properties if needed
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Since:
2013

Autodesk.Revit.DB.Structure.FabricArea.FabricAreaType
The type of the Fabric Area.
Since:
2013

Autodesk.Revit.DB.Structure.FabricArea.TagViewId
The element of the view in which to tag new members of this element.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: tagViewId is not a valid view for tagging the FabricArea or FabricSheets.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Since:
2013

Autodesk.Revit.DB.Structure.FabricArea.CoverOffset
The additional cover offset of the fabric distribution.
Since:
2013

Autodesk.Revit.DB.Structure.FabricArea.MinorLapSpliceLength
The fabric lap splice length in the fabric distribution in the minor direction.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: minorLapSpliceLength is greater than the half of the overall width.
Since:
2013

Autodesk.Revit.DB.Structure.FabricArea.MajorLapSpliceLength
The fabric lap splice length in the fabric distribution in the major direction.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: majorLapSpliceLength is greater than the half of the overall length.
Since:
2013

Autodesk.Revit.DB.Structure.FabricArea.LapSplicePosition
The fabric lap splice position in the fabric distribution.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Since:
2013